In [ ]:
#Importing pandas, DataFrame and sqlite3
import pandas as pd
from pandas import DataFrame, Series
import sqlite3

In [ ]:
#Creating the database week9.db
db=sqlite3.connect('C:/Users/KATERINE/Documents/week9/week9.db')

In [ ]:
#Connecting to the database 
#Executing the script Chinook_Sqlite.sql
qry = open('C:/Users/KATERINE/Documents/week9/Chinook_Sqlite.sql','r').read()
con=sqlite3.connect('C:/Users/KATERINE/Documents/week9/week9.db')
cur=con.cursor()
cur.executescript(qry)
db.commit()

In [14]:
#Creating the dataframe
df = pd.read_sql_query("SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title  from Customer inner join Invoice on \
(Customer.CustomerID=Invoice.CustomerID) inner join InvoiceLine on (Invoice.InvoiceID=InvoiceLine.InvoiceID) \
inner join Track on (InvoiceLine.TrackID=Track.TrackID) \
inner join Album on (Track.AlbumID=Album.AlbumID) order by Customer.LastName, Customer.FirstName limit 5;", db)
df

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas